# POSTTEST 4

Di bawah ini merupakan import library python yang akan dipakai

In [115]:
import pandas as pd
import sklearn as sk
from sklearn.model_selection import train_test_split
import numpy as np

Di bawah ini merupakan pengambilan file csv yang berjudul salaries_cyber.csv dengan memberikan nama dataset_utama

In [116]:
dataset_utama = pd.read_csv("salaries_cyber.csv")

In [117]:
dataset_utama.shape

(1247, 11)

In [118]:
dataset_utama

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,EN,FT,Cyber Program Manager,63000,USD,63000,US,50,US,S
1,2022,MI,FT,Security Analyst,95000,USD,95000,US,0,US,M
2,2022,MI,FT,Security Analyst,70000,USD,70000,US,0,US,M
3,2022,MI,FT,IT Security Analyst,250000,BRL,48853,BR,50,BR,L
4,2022,EN,CT,Cyber Security Analyst,120000,USD,120000,BW,100,BW,S
...,...,...,...,...,...,...,...,...,...,...,...
1242,2020,MI,FT,Cyber Security Analyst,140000,AUD,96422,AU,50,AU,M
1243,2021,SE,FT,Information Security Manager,60000,GBP,82528,GB,50,GB,L
1244,2021,SE,FT,Penetration Testing Engineer,126000,USD,126000,US,100,US,L
1245,2021,MI,FT,Information Security Analyst,42000,GBP,57769,GB,100,GB,L
1246,2021,MI,FT,Threat Intelligence Analyst,66310,USD,66310,US,0,US,L

Dibawah ini merupakan syntax untuk membagi data menjadi training set dan testing set

In [119]:
x = dataset_utama.iloc[:,:-1]
y = dataset_utama.iloc[:,-1]

In [120]:
X_train,X_test,y_train,y_test =  train_test_split(x,y, test_size = 0.2)

In [121]:
print("Dimensi X_train : ", X_train.shape)
print("Dimensi X_test : ", X_test.shape)
print("Dimensi Y_train : ", y_train.shape)
print("Dimensi Y_test : ", y_test.shape)

Dimensi X_train :  (997, 10)
Dimensi X_test :  (250, 10)
Dimensi Y_train :  (997,)
Dimensi Y_test :  (250,)

Di bawah ini merupakan syntax dari min max scaler, pertama import library 
MinMaxScaler dari sklearn.prreprocessing terlebih dahulu. Kemudian copy data dan beri nama dataset_no1, dan jalankan syntax.
dataset yang di ambil berupa numerik, jadi colom salaray,salary_in_usd, dan remote_ratio. Dan terakhir di tampilkan pada df2

In [122]:
from sklearn.preprocessing import MinMaxScaler

In [123]:
dataset_no1 = dataset_utama.copy()

In [124]:
min_max_scaler = MinMaxScaler()

In [125]:
x_scaler = min_max_scaler.fit_transform(dataset_no1[['salary','salary_in_usd','remote_ratio']])

In [126]:
df2 = pd.DataFrame(x_scaler)

In [127]:
df2.head(5)

          0         1    2
0  0.000123  0.067107  0.5
1  0.000187  0.102311  0.0
2  0.000137  0.074808  0.0
3  0.000497  0.051544  0.5
4  0.000237  0.129814  1.0

Di bawah ini merupakan syntax ketika ingin standarisasi data. 
import StandardScaler dari sklearn.preprocessing, lalu copy dataset_utama dan beri nama dataset_no2.
cek nama kolom, dan masukkan sytax untuk standarisasi dengan memasukkan kolom bernilai numerik, yaitu work_year, salary,salary_in_usd, dan remote_ratio. 
print data sebelum standarisasi untuk perbandingan, lalu print data setelah standarisasi untuk hasil akhir.
nilai yang di dapatkan adalah 0.999999 yang artinya merupakan nilai rata-rata.

In [128]:
from sklearn.preprocessing import StandardScaler

In [129]:
dataset_no2 = dataset_utama.copy()

In [130]:
dataset_no2.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [131]:
ss = StandardScaler()
Scaled_data = ss.fit_transform(dataset_no2[['work_year','salary','salary_in_usd','remote_ratio']])

In [132]:
print("Nilai Sebelum Strandarisasi")
print("Standart Deviasi :", np.std(dataset_no2))

Nilai Sebelum Strandarisasi
Standart Deviasi : work_year        7.152143e-01
salary           1.415376e+07
salary_in_usd    7.026321e+04
remote_ratio     3.933107e+01
dtype: float64

C:\Users\USER\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3571: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  return std(axis=axis, dtype=dtype, out=out, ddof=ddof, **kwargs)

In [133]:
print("Nilai Setelah Strandarisasi")
print("Standart Deviasi :", np.std(Scaled_data))

Nilai Setelah Strandarisasi
Standart Deviasi : 0.9999999999999998

# DATA CLEANING

Di bawah merupakan cara untuk mengganti data null kedalam mean, median dan modus.
Pertama ambil dahulu dataset yang telah di rusak sebelumnya, beri nama dataset_rusak.
Lalu import SimpleImputer dari sklearn.impute. Lalu deklarasikan imputer_mean, imputer_median, dan imputer_most_frequent(modus).
copy dataset dan berinama dataset_rusak_cleaned.
cek jumlah data null pada dataset.
dan masukkan data mean,median, modus pada kolom yang memiliki data null, yaitu salary, salary_in_usd, dan remote_ratio.
kemudia buat perbandingan antara data original dan data yg telah di bersihkan. 
print data pembanding untuk melihat hasil. Dan cek hasil data null

In [134]:
dataset_rusak = pd.read_csv("salaries_cyber_rusak.csv")
dataset_rusak.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,EN,FT,Cyber Program Manager,63000.0,USD,63000.0,US,50.0,US,S
1,2022,MI,FT,Security Analyst,95000.0,USD,95000.0,US,0.0,US,M
2,2022,MI,FT,Security Analyst,70000.0,USD,70000.0,US,0.0,US,M
3,2022,MI,FT,IT Security Analyst,250000.0,BRL,48853.0,BR,50.0,BR,L
4,2022,EN,CT,Cyber Security Analyst,120000.0,USD,120000.0,BW,100.0,BW,S

In [135]:
from sklearn.impute import SimpleImputer

In [136]:
imputer_mean = SimpleImputer(strategy='mean')
imputer_median = SimpleImputer(strategy='median')
imputer_most_frequent = SimpleImputer(strategy='most_frequent')

In [137]:
dataset_rusak_cleaned = dataset_rusak.copy()

In [138]:
dataset_rusak_cleaned.isna().sum()

work_year              0
experience_level       0
employment_type        0
job_title              0
salary                 7
salary_currency        0
salary_in_usd         16
employee_residence     0
remote_ratio           3
company_location       0
company_size           0
dtype: int64

In [139]:
dataset_rusak_cleaned.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [140]:
dataset_rusak_cleaned['salary'] = imputer_median.fit_transform(dataset_rusak[['salary']])
dataset_rusak_cleaned['salary_in_usd'] = imputer_most_frequent.fit_transform(dataset_rusak[['salary_in_usd']])
dataset_rusak_cleaned['remote_ratio'] = imputer_median.fit_transform(dataset_rusak[['remote_ratio']])

In [141]:
data_pembanding = pd.DataFrame(
{
    "salary_original":dataset_rusak_cleaned['salary'],
    "salary_cleaned":dataset_rusak['salary'],
     "salary_in_usd_original":dataset_rusak_cleaned['salary_in_usd'],
    "salary_in_usd_cleaned":dataset_rusak['salary_in_usd'],
     "remote_ratio_original":dataset_rusak_cleaned['remote_ratio'],
    "remote_ratio_cleaned":dataset_rusak['remote_ratio']
}
)

In [142]:
data_pembanding.tail(30)

,salary_original,salary_cleaned,salary_in_usd_original,salary_in_usd_cleaned,remote_ratio_original,remote_ratio_cleaned
1223,149000.0,149000.0,149000.0,149000.0,50.0,50.0
1224,140000.0,140000.0,140000.0,140000.0,50.0,50.0
1225,120000.0,NaN,116000.0,116000.0,50.0,50.0
1226,81000.0,81000.0,81000.0,81000.0,100.0,100.0
1227,115000.0,115000.0,115000.0,115000.0,100.0,NaN
1228,128000.0,128000.0,128000.0,128000.0,100.0,100.0
1229,63000.0,63000.0,71849.0,71849.0,0.0,0.0
1230,100000.0,100000.0,114047.0,114047.0,100.0,100.0
1231,122750.0,122750.0,122750.0,122750.0,100.0,100.0
1232,144000.0,144000.0,144000.0,144000.0,0.0,0.0
1233,80000.0,80000.0,102611.0,102611.0,50.0,50.0
1234,120000.0,NaN,100000.0,100000.0,0.0,0.0
1235,110000.0,110000.0,110000.0,110000.0,50.0,50.0
1236,35000.0,35000.0,35000.0,35000.0,100.0,100.0
1237,65000.0,65000.0,65000.0,65000.0,100.0,100.0
1238,170000.0,170000.0,170000.0,170000.0,100.0,100.0
1239,135000.0,135000.0,135000.0,135000.0,100.0,100.0
1240,100000.0,100000.0,100000.0,100000.0,50.0,50.0
1241,356000.0,356000.0,456621.0,456621.0,100.0,100.0
1242,140000.0,140000.0,96422.0,96422.0,50.0,50.0
1243,60000.0,60000.0,82528.0,82528.0,50.0,50.0
1244,126000.0,126000.0,126000.0,126000.0,100.0,100.0
1245,42000.0,42000.0,57769.0,57769.0,100.0,100.0
1246,66310.0,66310.0,66310.0,66310.0,0.0,0.0
1247,115000.0,115000.0,90218.0,90218.0,100.0,100.0
1248,145000.0,145000.0,145000.0,145000.0,0.0,0.0
1249,135000.0,135000.0,135000.0,135000.0,0.0,0.0
1250,88000.0,88000.0,88000.0,88000.0,0.0,0.0
1251,84000.0,84000.0,84000.0,84000.0,0.0,0.0
1252,120000.0,120000.0,120000.0,120000.0,100.0,100.0

In [143]:
dataset_rusak_cleaned.isna().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

Menghapus data yang memiliki duplikat dengan drop_duplicates.

In [144]:
dataset_rusak_cleaned.duplicated().sum()

85

In [145]:
dataset_rusak_cleaned.drop_duplicates(inplace=True)

In [146]:
dataset_rusak_cleaned.duplicated().sum()

0

Mengganti tipe data salah satu attribute angka. disini pada kolom salary_in_usd yang awalnya bertipe float64 diganti menjadi int64

In [147]:
dataset_rusak_cleaned['salary_in_usd'].dtype

dtype('float64')

In [148]:
dataset_utama['salary_in_usd'].astype('int64')

0        63000
1        95000
2        70000
3        48853
4       120000
         ...
1242     96422
1243     82528
1244    126000
1245     57769
1246     66310
Name: salary_in_usd, Length: 1247, dtype: int64

Membuat copy dataset_utama dengan memberi nama dataset_enc, untuk one hot encoding.
menggunakan syntax pandas yaitu pd.get_dummies dengan dataset_enc dan kolom yang diambil adalah experience level.

In [149]:
dataset_enc = dataset_utama.copy()

In [150]:
pd.get_dummies(dataset_enc.experience_level)

      EN  EX  MI  SE
0      1   0   0   0
1      0   0   1   0
2      0   0   1   0
3      0   0   1   0
4      1   0   0   0
...   ..  ..  ..  ..
1242   0   0   1   0
1243   0   0   0   1
1244   0   0   0   1
1245   0   0   1   0
1246   0   0   1   0

[1247 rows x 4 columns]